In [17]:
import pandas as pd

In [18]:
# Rutas y nombres de los CSV
temp = 'temp.csv'
precip = 'precip.csv'

# Leer archivos CSV
df = pd.read_csv(temp)
dfP = pd.read_csv(precip)

In [19]:
dfP.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2844 entries, 0 to 2843
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Any             2844 non-null   int64
 1   Mes             2844 non-null   int64
 2   Desc_Mes        2844 non-null   object
 3   Precipitacions  2844 non-null   float64
dtypes: float64(1), int64(2), object(1)
memory usage: 89.0+ KB

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2916 entries, 0 to 2915
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Any          2916 non-null   int64
 1   Mes          2916 non-null   int64
 2   Desc_Mes     2916 non-null   object
 3   Temperatura  2916 non-null   float64
dtypes: float64(1), int64(2), object(1)
memory usage: 91.2+ KB

In [21]:
dfP.tail()

       Any  Mes  Desc_Mes  Precipitacions
2839  2022    8     Agost            67.9
2840  2022    9  Setembre            13.1
2841  2022   10   Octubre            11.3
2842  2022   11  Novembre             7.6
2843  2022   12  Desembre            33.0

In [22]:
df.tail()

       Any  Mes  Desc_Mes  Temperatura
2911  2022    8     Agost         27.2
2912  2022    9  Setembre         22.5
2913  2022   10   Octubre         20.7
2914  2022   11  Novembre         15.2
2915  2022   12  Desembre         12.6

In [23]:
dfP.head()

    Any  Mes Desc_Mes  Precipitacions
0  1786    1    Gener            32.8
1  1786    2   Febrer            28.4
2  1786    3     Març            84.4
3  1786    4    Abril            42.3
4  1786    5     Maig             8.5

In [24]:
df.head()

    Any  Mes Desc_Mes  Temperatura
0  1780    1    Gener          6.7
1  1780    2   Febrer          7.3
2  1780    3     Març         11.6
3  1780    4    Abril         11.4
4  1780    5     Maig         16.3

In [34]:
# Eliminamos las filas correspondientes a los años del 1780 al 1785 de dfP
df = df.drop(df[(df['Any'] >= 1780) & (df['Any'] <= 1785)].index)

In [26]:
df.head()

     Any  Mes Desc_Mes  Temperatura
72  1786    1    Gener          7.8
73  1786    2   Febrer          8.3
74  1786    3     Març          9.9
75  1786    4    Abril         12.8
76  1786    5     Maig         16.8

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2844 entries, 72 to 2915
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Any          2844 non-null   int64
 1   Mes          2844 non-null   int64
 2   Desc_Mes     2844 non-null   object
 3   Temperatura  2844 non-null   float64
dtypes: float64(1), int64(2), object(1)
memory usage: 89.0+ KB

In [28]:
dfP.head()

    Any  Mes Desc_Mes  Precipitacions
0  1786    1    Gener            32.8
1  1786    2   Febrer            28.4
2  1786    3     Març            84.4
3  1786    4    Abril            42.3
4  1786    5     Maig             8.5

In [29]:
df['Precipitacion'] = dfP.iloc[:, -1]

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2844 entries, 72 to 2915
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Any            2844 non-null   int64
 1   Mes            2844 non-null   int64
 2   Desc_Mes       2844 non-null   object
 3   Temperatura    2844 non-null   float64
 4   Precipitacion  2772 non-null   float64
dtypes: float64(2), int64(2), object(1)
memory usage: 111.2+ KB

In [31]:
#df.to_csv('TempPrecip.csv', index=False)